[Survived] StringLiteral
src/App.jsx:11:50
 import RansomwareAlertModal from './components/RansomwareAlertModal';
 
 function App() {
-  const [currentView, setCurrentView] = useState('dashboard');
+  const [currentView, setCurrentView] = useState("");
   const [ransomwareAlertData, setRansomwareAlertData] = useState(null);
 

[Killed] BlockStatement
src/App.jsx:14:19
   const [currentView, setCurrentView] = useState('dashboard');
   const [ransomwareAlertData, setRansomwareAlertData] = useState(null);
 
-  useEffect(() => {
-    // Listen for Ransomware alert
-    if (window.electronAPI) {
-      window.electronAPI.onRansomwareAlert((data) => {
-        setRansomwareAlertData(data);
-      });
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   const renderView = () => {
killedBy: App registers ransomware alert listener when electronAPI is available
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/App.jsx:16:9
 
   useEffect(() => {
     // Listen for Ransomware alert
-    if (window.electronAPI) {
+    if (false) {
       window.electronAPI.onRansomwareAlert((data) => {
         setRansomwareAlertData(data);
killedBy: App registers ransomware alert listener when electronAPI is available
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/App.jsx:16:29
 
   useEffect(() => {
     // Listen for Ransomware alert
-    if (window.electronAPI) {
-      window.electronAPI.onRansomwareAlert((data) => {
-        setRansomwareAlertData(data);
-      });
-    }
+    if (window.electronAPI) {}
   }, []);
 
killedBy: App registers ransomware alert listener when electronAPI is available
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/App.jsx:17:54
   useEffect(() => {
     // Listen for Ransomware alert
     if (window.electronAPI) {
-      window.electronAPI.onRansomwareAlert((data) => {
-        setRansomwareAlertData(data);
-      });
+      window.electronAPI.onRansomwareAlert((data) => {});
     }
   }, []);
killedBy: App shows ransomware modal when alert fires and dismisses it
statusReason: Unable to find an element by: [data-testid="ransomware-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="dashboard"

[Survived] ArrayDeclaration
src/App.jsx:21:6
         setRansomwareAlertData(data);
       });
     }
-  }, []);
+  }, ["Stryker was here"]);
 
   const renderView = () => {

[Killed] BlockStatement
src/App.jsx:23:28
     }
   }, []);
 
-  const renderView = () => {
-    switch (currentView) {
-      case 'dashboard': return <Dashboard setCurrentView={setCurrentView} />;
-      case 'scan': return <Scan />;
-      case 'realtime': return <RealTime />;
-      case 'quarantine': return <Quarantine />;
-      case 'history': return <History />;
-      default: return <Dashboard setCurrentView={setCurrentView} />;
-    }
-  };
+  const renderView = () => {};
 
   return (
killedBy: App renders the layout with dashboard by default
statusReason: Unable to find an element by: [data-testid="dashboard-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="dashboard"

[Killed] ConditionalExpression
src/App.jsx:25:7
 
   const renderView = () => {
     switch (currentView) {
-      case 'dashboard': return <Dashboard setCurrentView={setCurrentView} />;
+      case 'dashboard':
       case 'scan': return <Scan />;
       case 'realtime': return <RealTime />;
killedBy: App renders the layout with dashboard by default
statusReason: Unable to find an element by: [data-testid="dashboard-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="dashboard"

[Killed] ConditionalExpression
src/App.jsx:26:7
   const renderView = () => {
     switch (currentView) {
       case 'dashboard': return <Dashboard setCurrentView={setCurrentView} />;
-      case 'scan': return <Scan />;
+      case 'scan':
       case 'realtime': return <RealTime />;
       case 'quarantine': return <Quarantine />;
killedBy: App navigates to scan page
statusReason: Unable to find an element by: [data-testid="scan-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="scan"

[Killed] ConditionalExpression
src/App.jsx:27:7
     switch (currentView) {
       case 'dashboard': return <Dashboard setCurrentView={setCurrentView} />;
       case 'scan': return <Scan />;
-      case 'realtime': return <RealTime />;
+      case 'realtime':
       case 'quarantine': return <Quarantine />;
       case 'history': return <History />;
killedBy: App navigates to realtime page
statusReason: Unable to find an element by: [data-testid="realtime-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="realtime"

[Killed] ConditionalExpression
src/App.jsx:28:7
       case 'dashboard': return <Dashboard setCurrentView={setCurrentView} />;
       case 'scan': return <Scan />;
       case 'realtime': return <RealTime />;
-      case 'quarantine': return <Quarantine />;
+      case 'quarantine':
       case 'history': return <History />;
       default: return <Dashboard setCurrentView={setCurrentView} />;
killedBy: App navigates to quarantine page
statusReason: Unable to find an element by: [data-testid="quarantine-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="quarantine"

[Killed] ConditionalExpression
src/App.jsx:29:7
       case 'scan': return <Scan />;
       case 'realtime': return <RealTime />;
       case 'quarantine': return <Quarantine />;
-      case 'history': return <History />;
+      case 'history':
       default: return <Dashboard setCurrentView={setCurrentView} />;
     }
killedBy: App navigates to history page
statusReason: Unable to find an element by: [data-testid="history-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="history"

[Killed] StringLiteral
src/App.jsx:29:12
       case 'scan': return <Scan />;
       case 'realtime': return <RealTime />;
       case 'quarantine': return <Quarantine />;
-      case 'history': return <History />;
+      case "": return <History />;
       default: return <Dashboard setCurrentView={setCurrentView} />;
     }
killedBy: App navigates to history page
statusReason: Unable to find an element by: [data-testid="history-page"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="layout"
      data-view="history"

[NoCoverage] ConditionalExpression
src/App.jsx:30:7
       case 'realtime': return <RealTime />;
       case 'quarantine': return <Quarantine />;
       case 'history': return <History />;
-      default: return <Dashboard setCurrentView={setCurrentView} />;
+      default:
     }
   };

[Killed] ArrowFunction
src/App.jsx:41:20
       </Layout>
       <RansomwareAlertModal 
         data={ransomwareAlertData} 
-        onDismiss={() => setRansomwareAlertData(null)} 
+        onDismiss={() => undefined} 
       />
     </>
killedBy: App shows ransomware modal when alert fires and dismisses it
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ransomware-modal"
>
  <span>
    /test/file.txt
  </span>
