[Survived] BooleanLiteral
src/pages/Quarantine.jsx:6:42
 
 export default function Quarantine() {
   const [records, setRecords] = useState([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   const fetchRecords = async () => {

[Killed] BlockStatement
src/pages/Quarantine.jsx:8:36
   const [records, setRecords] = useState([]);
   const [loading, setLoading] = useState(true);
 
-  const fetchRecords = async () => {
-    if (window.electronAPI) {
-      setLoading(true);
-      try {
-        const data = await window.electronAPI.getQuarantineRecords();
-        setRecords(data.filter(r => r.restored === 0));
-      } catch (err) {
-        console.error("Error cargando cuarentena:", err);
-      } finally {
-        setLoading(false);
-      }
-    }
-  };
+  const fetchRecords = async () => {};
 
   useEffect(() => {
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Quarantine.jsx:9:9
   const [loading, setLoading] = useState(true);
 
   const fetchRecords = async () => {
-    if (window.electronAPI) {
+    if (false) {
       setLoading(true);
       try {
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Quarantine.jsx:9:29
   const [loading, setLoading] = useState(true);
 
   const fetchRecords = async () => {
-    if (window.electronAPI) {
-      setLoading(true);
-      try {
-        const data = await window.electronAPI.getQuarantineRecords();
-        setRecords(data.filter(r => r.restored === 0));
-      } catch (err) {
-        console.error("Error cargando cuarentena:", err);
-      } finally {
-        setLoading(false);
-      }
-    }
+    if (window.electronAPI) {}
   };
 
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Quarantine.jsx:11:11
   const fetchRecords = async () => {
     if (window.electronAPI) {
       setLoading(true);
-      try {
-        const data = await window.electronAPI.getQuarantineRecords();
-        setRecords(data.filter(r => r.restored === 0));
-      } catch (err) {
+      try {} catch (err) {
         console.error("Error cargando cuarentena:", err);
       } finally {
killedBy: Quarantine shows loading state initially with electronAPI
statusReason: Unable to find an element with the text: Cargando registros.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Quarantine.jsx:13:37
       setLoading(true);
       try {
         const data = await window.electronAPI.getQuarantineRecords();
-        setRecords(data.filter(r => r.restored === 0));
+        setRecords(data.filter(r => false));
       } catch (err) {
         console.error("Error cargando cuarentena:", err);
killedBy: Quarantine shows quarantine records in table
statusReason: Unable to find an element with the text: Eicar-Test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Quarantine.jsx:13:37
       setLoading(true);
       try {
         const data = await window.electronAPI.getQuarantineRecords();
-        setRecords(data.filter(r => r.restored === 0));
+        setRecords(data.filter(r => true));
       } catch (err) {
         console.error("Error cargando cuarentena:", err);
killedBy: Quarantine filters out restored records
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="inline-flex items-center gap-1.5 px-2.5 py-1 rounded-md text-xs font-mono font-medium bg-red-500/10 text-[var(--accent-danger)] border border-red-500/20"
>
  RestoredThreat
</span> instead

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:14:21
       try {
         const data = await window.electronAPI.getQuarantineRecords();
         setRecords(data.filter(r => r.restored === 0));
-      } catch (err) {
-        console.error("Error cargando cuarentena:", err);
-      } finally {
+      } catch (err) {} finally {
         setLoading(false);
       }

[Killed] BlockStatement
src/pages/Quarantine.jsx:16:17
         setRecords(data.filter(r => r.restored === 0));
       } catch (err) {
         console.error("Error cargando cuarentena:", err);
-      } finally {
-        setLoading(false);
-      }
+      } finally {}
     }
   };
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Quarantine.jsx:22:19
     }
   };
 
-  useEffect(() => {
-    // eslint-disable-next-line react-hooks/set-state-in-effect
-    fetchRecords();
-  }, []);
+  useEffect(() => {}, []);
 
   const handleRestore = async (id) => {
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:27:39
     fetchRecords();
   }, []);
 
-  const handleRestore = async (id) => {
-    if (!window.confirm('¿Estás seguro de que deseas restaurar este archivo infectado? El sistema volverá a ser vulnerable.')) return;
-    
-    if (window.electronAPI) {
-      const res = await window.electronAPI.restoreFile(id);
-      if (res.success) {
-        fetchRecords();
-      } else {
-        alert('Error al restaurar: ' + res.error);
-      }
-    }
-  };
+  const handleRestore = async (id) => {};
 
   const handleDelete = async (id) => {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:28:9
   }, []);
 
   const handleRestore = async (id) => {
-    if (!window.confirm('¿Estás seguro de que deseas restaurar este archivo infectado? El sistema volverá a ser vulnerable.')) return;
+    if (false) return;
     
     if (window.electronAPI) {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:28:9
   }, []);
 
   const handleRestore = async (id) => {
-    if (!window.confirm('¿Estás seguro de que deseas restaurar este archivo infectado? El sistema volverá a ser vulnerable.')) return;
+    if (true) return;
     
     if (window.electronAPI) {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:30:9
   const handleRestore = async (id) => {
     if (!window.confirm('¿Estás seguro de que deseas restaurar este archivo infectado? El sistema volverá a ser vulnerable.')) return;
     
-    if (window.electronAPI) {
+    if (false) {
       const res = await window.electronAPI.restoreFile(id);
       if (res.success) {

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:30:29
   const handleRestore = async (id) => {
     if (!window.confirm('¿Estás seguro de que deseas restaurar este archivo infectado? El sistema volverá a ser vulnerable.')) return;
     
-    if (window.electronAPI) {
-      const res = await window.electronAPI.restoreFile(id);
-      if (res.success) {
-        fetchRecords();
-      } else {
-        alert('Error al restaurar: ' + res.error);
-      }
-    }
+    if (window.electronAPI) {}
   };
 

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:32:24
     
     if (window.electronAPI) {
       const res = await window.electronAPI.restoreFile(id);
-      if (res.success) {
-        fetchRecords();
-      } else {
+      if (res.success) {} else {
         alert('Error al restaurar: ' + res.error);
       }

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:32:11
     
     if (window.electronAPI) {
       const res = await window.electronAPI.restoreFile(id);
-      if (res.success) {
+      if (false) {
         fetchRecords();
       } else {

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:34:14
       const res = await window.electronAPI.restoreFile(id);
       if (res.success) {
         fetchRecords();
-      } else {
-        alert('Error al restaurar: ' + res.error);
-      }
+      } else {}
     }
   };

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:40:38
     }
   };
 
-  const handleDelete = async (id) => {
-    if (!window.confirm('¿Eliminar permanentemente este archivo? Esta acción no se puede deshacer.')) return;
-    
-    if (window.electronAPI) {
-      const res = await window.electronAPI.deleteQuarantineFile(id);
-      if (res.success) {
-        fetchRecords();
-      } else {
-        alert('Error al eliminar: ' + res.error);
-      }
-    }
-  };
+  const handleDelete = async (id) => {};
 
   return (

[NoCoverage] BooleanLiteral
src/pages/Quarantine.jsx:41:9
   };
 
   const handleDelete = async (id) => {
-    if (!window.confirm('¿Eliminar permanentemente este archivo? Esta acción no se puede deshacer.')) return;
+    if (window.confirm('¿Eliminar permanentemente este archivo? Esta acción no se puede deshacer.')) return;
     
     if (window.electronAPI) {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:41:9
   };
 
   const handleDelete = async (id) => {
-    if (!window.confirm('¿Eliminar permanentemente este archivo? Esta acción no se puede deshacer.')) return;
+    if (true) return;
     
     if (window.electronAPI) {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:43:9
   const handleDelete = async (id) => {
     if (!window.confirm('¿Eliminar permanentemente este archivo? Esta acción no se puede deshacer.')) return;
     
-    if (window.electronAPI) {
+    if (true) {
       const res = await window.electronAPI.deleteQuarantineFile(id);
       if (res.success) {

[NoCoverage] ConditionalExpression
src/pages/Quarantine.jsx:45:11
     
     if (window.electronAPI) {
       const res = await window.electronAPI.deleteQuarantineFile(id);
-      if (res.success) {
+      if (false) {
         fetchRecords();
       } else {

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:45:24
     
     if (window.electronAPI) {
       const res = await window.electronAPI.deleteQuarantineFile(id);
-      if (res.success) {
-        fetchRecords();
-      } else {
+      if (res.success) {} else {
         alert('Error al eliminar: ' + res.error);
       }

[NoCoverage] BlockStatement
src/pages/Quarantine.jsx:47:14
       const res = await window.electronAPI.deleteQuarantineFile(id);
       if (res.success) {
         fetchRecords();
-      } else {
-        alert('Error al eliminar: ' + res.error);
-      }
+      } else {}
     }
   };

[Killed] ConditionalExpression
src/pages/Quarantine.jsx:73:13
           <div className="flex-1 flex justify-center items-center text-[var(--text-muted)]">
             Cargando registros...
           </div>
-        ) : records.length === 0 ? (
+        ) : false ? (
           <div className="flex-1 flex flex-col justify-center items-center text-[var(--text-muted)] p-8 text-center">
             <AlertTriangle size={48} className="mb-4 opacity-20" />
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] EqualityOperator
src/pages/Quarantine.jsx:73:13
           <div className="flex-1 flex justify-center items-center text-[var(--text-muted)]">
             Cargando registros...
           </div>
-        ) : records.length === 0 ? (
+        ) : records.length !== 0 ? (
           <div className="flex-1 flex flex-col justify-center items-center text-[var(--text-muted)] p-8 text-center">
             <AlertTriangle size={48} className="mb-4 opacity-20" />
killedBy: Quarantine shows empty quarantine message after loading
statusReason: Unable to find an element with the text: La cuarentena está vacía. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Quarantine.jsx:95:26
                   <tr key={record.id} className="hover:bg-[var(--bg-card)] transition-colors">
                     <td className="px-6 py-4">
                       <span className="inline-flex items-center gap-1.5 px-2.5 py-1 rounded-md text-xs font-mono font-medium bg-red-500/10 text-[var(--accent-danger)] border border-red-500/20">
-                        {record.threat_name || 'Desconocido'}
+                        {false}
                       </span>
                     </td>
killedBy: Quarantine shows quarantine records in table
statusReason: Unable to find an element with the text: Eicar-Test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] LogicalOperator
src/pages/Quarantine.jsx:95:26
                   <tr key={record.id} className="hover:bg-[var(--bg-card)] transition-colors">
                     <td className="px-6 py-4">
                       <span className="inline-flex items-center gap-1.5 px-2.5 py-1 rounded-md text-xs font-mono font-medium bg-red-500/10 text-[var(--accent-danger)] border border-red-500/20">
-                        {record.threat_name || 'Desconocido'}
+                        {record.threat_name && 'Desconocido'}
                       </span>
                     </td>
killedBy: Quarantine shows quarantine records in table
statusReason: Unable to find an element with the text: Eicar-Test. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Survived] ArrowFunction
src/pages/Quarantine.jsx:106:34
                     </td>
                     <td className="px-6 py-4 flex items-center justify-end gap-2">
                       <button 
-                        onClick={() => handleRestore(record.id)}
+                        onClick={() => undefined}
                         className="p-2 text-[var(--text-muted)] hover:text-[var(--accent-warning)] hover:bg-[var(--accent-warning)]/10 rounded transition-colors"
                         title="Restaurar al sistema"

[Survived] ArrowFunction
src/pages/Quarantine.jsx:113:34
                         <RotateCcw size={16} />
                       </button>
                       <button 
-                        onClick={() => handleDelete(record.id)}
+                        onClick={() => undefined}
                         className="p-2 text-[var(--text-muted)] hover:text-[var(--accent-danger)] hover:bg-[var(--accent-danger)]/10 rounded transition-colors"
                         title="Eliminar permanentemente"
