[Killed] BooleanLiteral
src/pages/RealTime.jsx:6:56
 import LogViewer from '../components/LogViewer';
 
 export default function RealTime() {
-  const [realtimeStatus, setRealtimeStatus] = useState(false);
+  const [realtimeStatus, setRealtimeStatus] = useState(true);
   const [antiRansomwareStatus, setAntiRansomwareStatus] = useState(false);
   const [logs, setLogs] = useState([]);
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BooleanLiteral
src/pages/RealTime.jsx:7:68
 
 export default function RealTime() {
   const [realtimeStatus, setRealtimeStatus] = useState(false);
-  const [antiRansomwareStatus, setAntiRansomwareStatus] = useState(false);
+  const [antiRansomwareStatus, setAntiRansomwareStatus] = useState(true);
   const [logs, setLogs] = useState([]);
 
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Found multiple elements with the text: ACTIVO

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-[var(--accent-primary)]"
>

[Killed] BlockStatement
src/pages/RealTime.jsx:10:19
   const [antiRansomwareStatus, setAntiRansomwareStatus] = useState(false);
   const [logs, setLogs] = useState([]);
 
-  useEffect(() => {
-    if (window.electronAPI) {
-      window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
-      window.electronAPI.getAntiransomwareStatus().then(setAntiRansomwareStatus);
-      
-      window.electronAPI.onRealtimeStatusChanged((status) => {
-        setRealtimeStatus(status);
-      });
-
-      window.electronAPI.onAntiransomwareStatusChanged((status) => {
-        setAntiRansomwareStatus(status);
-      });
-
-      // Capture logs relevant to real-time (we will capture all logs for simplicity, 
-      // but they are prefixed in watcher.js)
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   const handleToggle = async () => {
killedBy: RealTime fetches statuses from electronAPI on mount
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/pages/RealTime.jsx:11:29
   const [logs, setLogs] = useState([]);
 
   useEffect(() => {
-    if (window.electronAPI) {
-      window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
-      window.electronAPI.getAntiransomwareStatus().then(setAntiRansomwareStatus);
-      
-      window.electronAPI.onRealtimeStatusChanged((status) => {
-        setRealtimeStatus(status);
-      });
-
-      window.electronAPI.onAntiransomwareStatusChanged((status) => {
-        setAntiRansomwareStatus(status);
-      });
-
-      // Capture logs relevant to real-time (we will capture all logs for simplicity, 
-      // but they are prefixed in watcher.js)
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
-    }
+    if (window.electronAPI) {}
   }, []);
 
killedBy: RealTime fetches statuses from electronAPI on mount
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:15:62
       window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
       window.electronAPI.getAntiransomwareStatus().then(setAntiRansomwareStatus);
       
-      window.electronAPI.onRealtimeStatusChanged((status) => {
-        setRealtimeStatus(status);
-      });
+      window.electronAPI.onRealtimeStatusChanged((status) => {});
 
       window.electronAPI.onAntiransomwareStatusChanged((status) => {

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:19:68
         setRealtimeStatus(status);
       });
 
-      window.electronAPI.onAntiransomwareStatusChanged((status) => {
-        setAntiRansomwareStatus(status);
-      });
+      window.electronAPI.onAntiransomwareStatusChanged((status) => {});
 
       // Capture logs relevant to real-time (we will capture all logs for simplicity, 

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:25:48
 
       // Capture logs relevant to real-time (we will capture all logs for simplicity, 
       // but they are prefixed in watcher.js)
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
+      window.electronAPI.onLogMessage((log) => {});
     }
   }, []);

[Killed] BlockStatement
src/pages/RealTime.jsx:31:36
     }
   }, []);
 
-  const handleToggle = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
-      setRealtimeStatus(newStatus);
-    } else {
-      setRealtimeStatus(!realtimeStatus);
-    }
-  };
+  const handleToggle = async () => {};
 
   const handleAntiransomwareToggle = async () => {
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/RealTime.jsx:32:9
   }, []);
 
   const handleToggle = async () => {
-    if (window.electronAPI) {
+    if (true) {
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:32:29
   }, []);
 
   const handleToggle = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
-      setRealtimeStatus(newStatus);
-    } else {
+    if (window.electronAPI) {} else {
       setRealtimeStatus(!realtimeStatus);
     }

[Killed] BlockStatement
src/pages/RealTime.jsx:35:12
     if (window.electronAPI) {
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
-    } else {
-      setRealtimeStatus(!realtimeStatus);
-    }
+    } else {}
   };
 
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BooleanLiteral
src/pages/RealTime.jsx:36:25
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
     } else {
-      setRealtimeStatus(!realtimeStatus);
+      setRealtimeStatus(realtimeStatus);
     }
   };
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:40:50
     }
   };
 
-  const handleAntiransomwareToggle = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
-      setAntiRansomwareStatus(newStatus);
-    } else {
-      setAntiRansomwareStatus(!antiRansomwareStatus);
-    }
-  };
+  const handleAntiransomwareToggle = async () => {};
 
   return (

[NoCoverage] ConditionalExpression
src/pages/RealTime.jsx:41:9
   };
 
   const handleAntiransomwareToggle = async () => {
-    if (window.electronAPI) {
+    if (true) {
       const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
       setAntiRansomwareStatus(newStatus);

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:41:29
   };
 
   const handleAntiransomwareToggle = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
-      setAntiRansomwareStatus(newStatus);
-    } else {
+    if (window.electronAPI) {} else {
       setAntiRansomwareStatus(!antiRansomwareStatus);
     }

[NoCoverage] BooleanLiteral
src/pages/RealTime.jsx:42:71
 
   const handleAntiransomwareToggle = async () => {
     if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
+      const newStatus = await window.electronAPI.toggleAntiransomware(antiRansomwareStatus);
       setAntiRansomwareStatus(newStatus);
     } else {

[NoCoverage] BlockStatement
src/pages/RealTime.jsx:44:12
     if (window.electronAPI) {
       const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
       setAntiRansomwareStatus(newStatus);
-    } else {
-      setAntiRansomwareStatus(!antiRansomwareStatus);
-    }
+    } else {}
   };
 

[NoCoverage] BooleanLiteral
src/pages/RealTime.jsx:45:31
       const newStatus = await window.electronAPI.toggleAntiransomware(!antiRansomwareStatus);
       setAntiRansomwareStatus(newStatus);
     } else {
-      setAntiRansomwareStatus(!antiRansomwareStatus);
+      setAntiRansomwareStatus(antiRansomwareStatus);
     }
   };

[Survived] StringLiteral
src/pages/RealTime.jsx:65:57
           </div>
           <div>
             <h2 className="text-xl font-semibold text-[var(--text-primary)]">
-              Estado: <span className={realtimeStatus ? 'text-[var(--accent-primary)]' : 'text-[var(--text-muted)]'}>
+              Estado: <span className={realtimeStatus ? "" : 'text-[var(--text-muted)]'}>
                 {realtimeStatus ? 'ACTIVO' : 'INACTIVO'}
               </span>

[Killed] StringLiteral
src/pages/RealTime.jsx:66:35
           <div>
             <h2 className="text-xl font-semibold text-[var(--text-primary)]">
               Estado: <span className={realtimeStatus ? 'text-[var(--accent-primary)]' : 'text-[var(--text-muted)]'}>
-                {realtimeStatus ? 'ACTIVO' : 'INACTIVO'}
+                {realtimeStatus ? "" : 'INACTIVO'}
               </span>
             </h2>
killedBy: RealTime toggles realtime status without electronAPI (fallback)
statusReason: Unable to find an element with the text: ACTIVO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] StringLiteral
src/pages/RealTime.jsx:72:19
             <p className="text-sm text-[var(--text-muted)] mt-1">
               {realtimeStatus 
                 ? 'Monitoreando las descargas y el escritorio continuamente.' 
-                : 'El sistema es vulnerable a nuevas descargas. Se recomienda activarlo.'}
+                : ""}
             </p>
           </div>
killedBy: RealTime shows vulnerability message when inactive
statusReason: Unable to find an element with the text: /El sistema es vulnerable/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Survived] StringLiteral
src/pages/RealTime.jsx:81:122
           onClick={handleToggle}
           className={`relative inline-flex h-8 w-14 items-center rounded-full transition-colors ${realtimeStatus ? 'bg-[var(--accent-primary)]' : 'bg-[var(--border)]'}`}
         >
-          <span className={`inline-block h-6 w-6 transform rounded-full bg-white transition-transform ${realtimeStatus ? 'translate-x-7' : 'translate-x-1'}`} />
+          <span className={`inline-block h-6 w-6 transform rounded-full bg-white transition-transform ${realtimeStatus ? "" : 'translate-x-1'}`} />
         </button>
       </div>

[Survived] StringLiteral
src/pages/RealTime.jsx:81:28
           onClick={handleToggle}
           className={`relative inline-flex h-8 w-14 items-center rounded-full transition-colors ${realtimeStatus ? 'bg-[var(--accent-primary)]' : 'bg-[var(--border)]'}`}
         >
-          <span className={`inline-block h-6 w-6 transform rounded-full bg-white transition-transform ${realtimeStatus ? 'translate-x-7' : 'translate-x-1'}`} />
+          <span className={``} />
         </button>
       </div>

[NoCoverage] StringLiteral
src/pages/RealTime.jsx:93:41
           <div>
             <h2 className="text-xl font-semibold text-[var(--text-primary)]">
               Anti-Ransomware (Heurística): <span className={antiRansomwareStatus ? 'text-red-500' : 'text-[var(--text-muted)]'}>
-                {antiRansomwareStatus ? 'ACTIVO' : 'INACTIVO'}
+                {antiRansomwareStatus ? "" : 'INACTIVO'}
               </span>
             </h2>

[NoCoverage] StringLiteral
src/pages/RealTime.jsx:98:19
             </h2>
             <p className="text-sm text-[var(--text-muted)] mt-1">
               {antiRansomwareStatus 
-                ? 'Vigilando archivos señuelo para detectar cifrado masivo en tiempo real.' 
+                ? "" 
                 : 'Protección avanzada desactivada. Vulnerable a ataques de Día Cero.'}
             </p>

[Survived] StringLiteral
src/pages/RealTime.jsx:106:22
 
         <button 
           onClick={handleAntiransomwareToggle}
-          className={`relative inline-flex h-8 w-14 items-center rounded-full transition-colors ${antiRansomwareStatus ? 'bg-red-500' : 'bg-[var(--border)]'}`}
+          className={``}
         >
           <span className={`inline-block h-6 w-6 transform rounded-full bg-white transition-transform ${antiRansomwareStatus ? 'translate-x-7' : 'translate-x-1'}`} />

[NoCoverage] StringLiteral
src/pages/RealTime.jsx:106:122
 
         <button 
           onClick={handleAntiransomwareToggle}
-          className={`relative inline-flex h-8 w-14 items-center rounded-full transition-colors ${antiRansomwareStatus ? 'bg-red-500' : 'bg-[var(--border)]'}`}
+          className={`relative inline-flex h-8 w-14 items-center rounded-full transition-colors ${antiRansomwareStatus ? "" : 'bg-[var(--border)]'}`}
         >
           <span className={`inline-block h-6 w-6 transform rounded-full bg-white transition-transform ${antiRansomwareStatus ? 'translate-x-7' : 'translate-x-1'}`} />
