[Survived] BlockStatement
src/components/LogViewer.jsx:7:19
 export default function LogViewer({ logs }) {
   const endRef = useRef(null);
 
-  useEffect(() => {
-    endRef.current?.scrollIntoView({ behavior: 'smooth' });
-  }, [logs]);
+  useEffect(() => {}, [logs]);
 
   const copyLogs = () => {

[Survived] OptionalChaining
src/components/LogViewer.jsx:8:5
   const endRef = useRef(null);
 
   useEffect(() => {
-    endRef.current?.scrollIntoView({ behavior: 'smooth' });
+    endRef.current.scrollIntoView({ behavior: 'smooth' });
   }, [logs]);
 

[Survived] StringLiteral
src/components/LogViewer.jsx:8:48
   const endRef = useRef(null);
 
   useEffect(() => {
-    endRef.current?.scrollIntoView({ behavior: 'smooth' });
+    endRef.current?.scrollIntoView({ behavior: "" });
   }, [logs]);
 

[NoCoverage] BlockStatement
src/components/LogViewer.jsx:11:26
     endRef.current?.scrollIntoView({ behavior: 'smooth' });
   }, [logs]);
 
-  const copyLogs = () => {
-    const text = logs.map(l => l.rawLine).join('\n');
-    navigator.clipboard.writeText(text);
-  };
+  const copyLogs = () => {};
 
   const getLineColor = (level) => {

[NoCoverage] ArrowFunction
src/components/LogViewer.jsx:12:27
   }, [logs]);
 
   const copyLogs = () => {
-    const text = logs.map(l => l.rawLine).join('\n');
+    const text = logs.map(() => undefined).join('\n');
     navigator.clipboard.writeText(text);
   };

[Killed] BlockStatement
src/components/LogViewer.jsx:16:35
     navigator.clipboard.writeText(text);
   };
 
-  const getLineColor = (level) => {
-    switch (level) {
-      case 'CLEAN':
-      case 'SUCCESS':
-        return 'text-[var(--accent-primary)]'; // --accent-primary
-      case 'THREAT':
-      case 'DANGER':
-        return 'text-[var(--accent-danger)]'; // --accent-danger
-      case 'WARNING':
-        return 'text-[var(--accent-warning)]'; // --accent-warning
-      case 'INFO':
-      default:
-        return 'text-[var(--accent-info)]'; // --accent-info
-    }
-  };
+  const getLineColor = (level) => {};
 
   return (
killedBy: LogViewer applies correct color class for CLEAN level
statusReason: expected 'break-words undefined' to contain 'text-[var(--accent-primary)]'

[Killed] ConditionalExpression
src/components/LogViewer.jsx:19:7
   const getLineColor = (level) => {
     switch (level) {
       case 'CLEAN':
-      case 'SUCCESS':
-        return 'text-[var(--accent-primary)]'; // --accent-primary
+      case 'SUCCESS': // --accent-primary // --accent-primary
       case 'THREAT':
       case 'DANGER':
killedBy: LogViewer applies correct color class for CLEAN level
statusReason: expected 'break-words text-[var(--accent-danger…' to contain 'text-[var(--accent-primary)]'

[Killed] StringLiteral
src/components/LogViewer.jsx:19:12
   const getLineColor = (level) => {
     switch (level) {
       case 'CLEAN':
-      case 'SUCCESS':
+      case "":
         return 'text-[var(--accent-primary)]'; // --accent-primary
       case 'THREAT':
killedBy: LogViewer applies correct color class for SUCCESS level
statusReason: expected 'break-words text-[var(--accent-info)]' to contain 'text-[var(--accent-primary)]'

[Killed] StringLiteral
src/components/LogViewer.jsx:21:12
       case 'CLEAN':
       case 'SUCCESS':
         return 'text-[var(--accent-primary)]'; // --accent-primary
-      case 'THREAT':
+      case "":
       case 'DANGER':
         return 'text-[var(--accent-danger)]'; // --accent-danger
killedBy: LogViewer applies correct color class for THREAT level
statusReason: expected 'break-words text-[var(--accent-info)]' to contain 'text-[var(--accent-danger)]'

[Killed] ConditionalExpression
src/components/LogViewer.jsx:22:7
       case 'SUCCESS':
         return 'text-[var(--accent-primary)]'; // --accent-primary
       case 'THREAT':
-      case 'DANGER':
-        return 'text-[var(--accent-danger)]'; // --accent-danger
+      case 'DANGER': // --accent-danger // --accent-danger
       case 'WARNING':
         return 'text-[var(--accent-warning)]'; // --accent-warning
killedBy: LogViewer applies correct color class for THREAT level
statusReason: expected 'break-words text-[var(--accent-warnin…' to contain 'text-[var(--accent-danger)]'

[Killed] ConditionalExpression
src/components/LogViewer.jsx:24:7
       case 'THREAT':
       case 'DANGER':
         return 'text-[var(--accent-danger)]'; // --accent-danger
-      case 'WARNING':
-        return 'text-[var(--accent-warning)]'; // --accent-warning
+      // --accent-danger
+case 'WARNING': // --accent-warning // --accent-warning
       case 'INFO':
       default:
killedBy: LogViewer applies correct color class for WARNING level
statusReason: expected 'break-words text-[var(--accent-info)]' to contain 'text-[var(--accent-warning)]'

[Killed] StringLiteral
src/components/LogViewer.jsx:24:12
       case 'THREAT':
       case 'DANGER':
         return 'text-[var(--accent-danger)]'; // --accent-danger
-      case 'WARNING':
+      case "":
         return 'text-[var(--accent-warning)]'; // --accent-warning
       case 'INFO':
killedBy: LogViewer applies correct color class for WARNING level
statusReason: expected 'break-words text-[var(--accent-info)]' to contain 'text-[var(--accent-warning)]'

[Killed] StringLiteral
src/components/LogViewer.jsx:25:16
       case 'DANGER':
         return 'text-[var(--accent-danger)]'; // --accent-danger
       case 'WARNING':
-        return 'text-[var(--accent-warning)]'; // --accent-warning
+        return ""; // --accent-warning
       case 'INFO':
       default:
killedBy: LogViewer applies correct color class for WARNING level
statusReason: expected 'break-words ' to contain 'text-[var(--accent-warning)]'

[Survived] StringLiteral
src/components/LogViewer.jsx:26:12
         return 'text-[var(--accent-danger)]'; // --accent-danger
       case 'WARNING':
         return 'text-[var(--accent-warning)]'; // --accent-warning
-      case 'INFO':
+      case "":
       default:
         return 'text-[var(--accent-info)]'; // --accent-info

[Killed] ConditionalExpression
src/components/LogViewer.jsx:27:7
       case 'WARNING':
         return 'text-[var(--accent-warning)]'; // --accent-warning
       case 'INFO':
-      default:
-        return 'text-[var(--accent-info)]'; // --accent-info
+      default: // --accent-info // --accent-info
     }
   };
killedBy: LogViewer applies correct color class for INFO level
statusReason: expected 'break-words undefined' to contain 'text-[var(--accent-info)]'

[Killed] ConditionalExpression
src/components/LogViewer.jsx:48:10
 
       {/* Log Output */}
       <div className="flex-1 p-4 overflow-y-auto font-mono text-xs leading-relaxed custom-scrollbar">
-        {logs.length === 0 ? (
+        {true ? (
           <div className="text-[var(--text-muted)] italic">Esperando eventos...</div>
         ) : (
killedBy: LogViewer renders log entries
statusReason: Unable to find an element with the text: [2026-01-15] [INFO] Scan started. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="relative flex flex-col h-full bg-[var(--bg-base)] border border-[var(--border)] rou

[Killed] EqualityOperator
src/components/LogViewer.jsx:48:10
 
       {/* Log Output */}
       <div className="flex-1 p-4 overflow-y-auto font-mono text-xs leading-relaxed custom-scrollbar">
-        {logs.length === 0 ? (
+        {logs.length !== 0 ? (
           <div className="text-[var(--text-muted)] italic">Esperando eventos...</div>
         ) : (
killedBy: LogViewer shows "Esperando eventos..." when logs are empty
statusReason: Unable to find an element with the text: Esperando eventos.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="relative flex flex-col h-full bg-[var(--bg-base)] border border-[var(--border)] rounded-md over

[Killed] ArrowFunction
src/components/LogViewer.jsx:51:20
         {logs.length === 0 ? (
           <div className="text-[var(--text-muted)] italic">Esperando eventos...</div>
         ) : (
-          logs.map((log, i) => (
-            <div key={i} className={`break-words ${getLineColor(log.level)}`}>
-              {log.rawLine}
-            </div>
-          ))
+          logs.map(() => undefined)
         )}
         <div ref={endRef} />
killedBy: LogViewer renders log entries
statusReason: Unable to find an element with the text: [2026-01-15] [INFO] Scan started. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="relative flex flex-col h-full bg-[var(--bg-base)] border border-[var(--border)] rou

[Killed] StringLiteral
src/components/LogViewer.jsx:52:37
           <div className="text-[var(--text-muted)] italic">Esperando eventos...</div>
         ) : (
           logs.map((log, i) => (
-            <div key={i} className={`break-words ${getLineColor(log.level)}`}>
+            <div key={i} className={``}>
               {log.rawLine}
             </div>
killedBy: LogViewer applies correct color class for CLEAN level
statusReason: expected '' to contain 'text-[var(--accent-primary)]'
