[Killed] BooleanLiteral
src/pages/Dashboard.jsx:5:56
 import { Shield, ShieldAlert, ShieldCheck, Activity, Clock, Zap, Search } from 'lucide-react';
 
 export default function Dashboard({ setCurrentView }) {
-  const [realtimeStatus, setRealtimeStatus] = useState(false);
+  const [realtimeStatus, setRealtimeStatus] = useState(true);
   const [lastScan, setLastScan] = useState(null);
   
killedBy: Dashboard shows Tiempo Real OFF by default when no electronAPI
statusReason: Unable to find an element with the text: OFF. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Dashboard.jsx:11:19
   // This would ideally come from the backend, but for the MVP UI we'll use state
   const status = 'PROTECTED'; // PROTECTED, THREAT, SCANNING
 
-  useEffect(() => {
-    // Fetch initial status from backend
-    if (window.electronAPI) {
-      window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
-      
-      // Listen for realtime status changes
-      window.electronAPI.onRealtimeStatusChanged((status) => {
-        setRealtimeStatus(status);
-      });
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   const toggleRealtime = async () => {
killedBy: Dashboard fetches realtime status from electronAPI on mount
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:13:9
 
   useEffect(() => {
     // Fetch initial status from backend
-    if (window.electronAPI) {
+    if (true) {
       window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
       
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Cannot read properties of undefined (reading 'getRealtimeStatus')

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:13:9
 
   useEffect(() => {
     // Fetch initial status from backend
-    if (window.electronAPI) {
+    if (false) {
       window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
       
killedBy: Dashboard fetches realtime status from electronAPI on mount
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/pages/Dashboard.jsx:17:62
       window.electronAPI.getRealtimeStatus().then(setRealtimeStatus);
       
       // Listen for realtime status changes
-      window.electronAPI.onRealtimeStatusChanged((status) => {
-        setRealtimeStatus(status);
-      });
+      window.electronAPI.onRealtimeStatusChanged((status) => {});
     }
   }, []);

[Killed] BlockStatement
src/pages/Dashboard.jsx:23:38
     }
   }, []);
 
-  const toggleRealtime = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
-      setRealtimeStatus(newStatus);
-    } else {
-      setRealtimeStatus(!realtimeStatus); // fallback for dev
-    }
-  };
+  const toggleRealtime = async () => {};
 
   return (
killedBy: Dashboard toggles realtime status when toggle button is clicked (no electronAPI)
statusReason: Unable to find an element with the text: ON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:24:9
   }, []);
 
   const toggleRealtime = async () => {
-    if (window.electronAPI) {
+    if (true) {
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
killedBy: Dashboard toggles realtime status when toggle button is clicked (no electronAPI)
statusReason: Unable to find an element with the text: ON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/Dashboard.jsx:24:29
   }, []);
 
   const toggleRealtime = async () => {
-    if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
-      setRealtimeStatus(newStatus);
-    } else {
+    if (window.electronAPI) {} else {
       setRealtimeStatus(!realtimeStatus); // fallback for dev
     }

[NoCoverage] BooleanLiteral
src/pages/Dashboard.jsx:25:65
 
   const toggleRealtime = async () => {
     if (window.electronAPI) {
-      const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
+      const newStatus = await window.electronAPI.toggleRealtime(realtimeStatus);
       setRealtimeStatus(newStatus);
     } else {

[Killed] BlockStatement
src/pages/Dashboard.jsx:27:12
     if (window.electronAPI) {
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
-    } else {
-      setRealtimeStatus(!realtimeStatus); // fallback for dev
-    }
+    } else {}
   };
 
killedBy: Dashboard toggles realtime status when toggle button is clicked (no electronAPI)
statusReason: Unable to find an element with the text: ON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] BooleanLiteral
src/pages/Dashboard.jsx:28:25
       const newStatus = await window.electronAPI.toggleRealtime(!realtimeStatus);
       setRealtimeStatus(newStatus);
     } else {
-      setRealtimeStatus(!realtimeStatus); // fallback for dev
+      setRealtimeStatus(realtimeStatus); // fallback for dev
     }
   };
killedBy: Dashboard toggles realtime status when toggle button is clicked (no electronAPI)
statusReason: Unable to find an element with the text: ON. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:37:11
       
       {/* Status Card Grande */}
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
-        ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
+        ${true ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
         ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}

[Survived] EqualityOperator
src/pages/Dashboard.jsx:37:11
       
       {/* Status Card Grande */}
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
-        ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
+        ${status !== 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
         ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}

[Survived] EqualityOperator
src/pages/Dashboard.jsx:38:11
       {/* Status Card Grande */}
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
         ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
-        ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
+        ${status !== 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:38:11
       {/* Status Card Grande */}
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
         ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
-        ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
+        ${true ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:39:11
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
         ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
         ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
-        ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
+        ${true ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>
         <div className={`p-6 rounded-full mb-4 

[Survived] EqualityOperator
src/pages/Dashboard.jsx:39:11
       <div className={`p-8 rounded-xl border flex flex-col items-center justify-center text-center transition-colors duration-500
         ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/10 border-[var(--accent-primary)]/30' : ''}
         ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/10 border-[var(--accent-danger)]/30' : ''}
-        ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
+        ${status !== 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>
         <div className={`p-6 rounded-full mb-4 

[Survived] EqualityOperator
src/pages/Dashboard.jsx:42:13
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>
         <div className={`p-6 rounded-full mb-4 
-          ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
+          ${status !== 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:42:13
         ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/10 border-[var(--accent-info)]/30' : ''}
       `}>
         <div className={`p-6 rounded-full mb-4 
-          ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
+          ${false ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:43:13
       `}>
         <div className={`p-6 rounded-full mb-4 
           ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
-          ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
+          ${false ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>

[Survived] EqualityOperator
src/pages/Dashboard.jsx:43:13
       `}>
         <div className={`p-6 rounded-full mb-4 
           ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
-          ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
+          ${status !== 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:44:13
         <div className={`p-6 rounded-full mb-4 
           ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
-          ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
+          ${false ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:44:13
         <div className={`p-6 rounded-full mb-4 
           ${status === 'PROTECTED' ? 'bg-[var(--accent-primary)]/20 animate-pulse text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
-          ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
+          ${true ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}

[Survived] LogicalOperator
src/pages/Dashboard.jsx:46:12
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
-          {status === 'PROTECTED' && <ShieldCheck size={80} />}
+          {status === 'PROTECTED' || <ShieldCheck size={80} />}
           {status === 'THREAT' && <ShieldAlert size={80} />}
           {status === 'SCANNING' && <Shield size={80} />}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:46:12
           ${status === 'THREAT' ? 'bg-[var(--accent-danger)]/20 text-[var(--accent-danger)] animate-bounce' : ''}
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
-          {status === 'PROTECTED' && <ShieldCheck size={80} />}
+          {true}
           {status === 'THREAT' && <ShieldAlert size={80} />}
           {status === 'SCANNING' && <Shield size={80} />}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:47:12
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}
-          {status === 'THREAT' && <ShieldAlert size={80} />}
+          {true}
           {status === 'SCANNING' && <Shield size={80} />}
         </div>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:47:12
           ${status === 'SCANNING' ? 'bg-[var(--accent-info)]/20 text-[var(--accent-info)] animate-spin-slow' : ''}
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}
-          {status === 'THREAT' && <ShieldAlert size={80} />}
+          {true && <ShieldAlert size={80} />}
           {status === 'SCANNING' && <Shield size={80} />}
         </div>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:48:12
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}
           {status === 'THREAT' && <ShieldAlert size={80} />}
-          {status === 'SCANNING' && <Shield size={80} />}
+          {true}
         </div>
         

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:48:12
         `}>
           {status === 'PROTECTED' && <ShieldCheck size={80} />}
           {status === 'THREAT' && <ShieldAlert size={80} />}
-          {status === 'SCANNING' && <Shield size={80} />}
+          {true && <Shield size={80} />}
         </div>
         

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:52:13
         </div>
         
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
-          ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
+          ${false ? 'text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:52:13
         </div>
         
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
-          ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
+          ${true ? 'text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:53:13
         
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
           ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
-          ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
+          ${false ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:53:13
         
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
           ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
-          ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
+          ${true ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>

[Survived] EqualityOperator
src/pages/Dashboard.jsx:54:13
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
           ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
-          ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
+          ${status !== 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}

[Survived] ConditionalExpression
src/pages/Dashboard.jsx:54:13
         <h2 className={`text-3xl font-display font-bold tracking-wider mb-2
           ${status === 'PROTECTED' ? 'text-[var(--accent-primary)]' : ''}
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
-          ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
+          ${false ? 'text-[var(--accent-info)]' : ''}
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:56:12
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>
-          {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
+          {false}
           {status === 'THREAT' && 'AMENAZA DETECTADA'}
           {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] LogicalOperator
src/pages/Dashboard.jsx:56:12
           ${status === 'THREAT' ? 'text-[var(--accent-danger)]' : ''}
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>
-          {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
+          {status === 'PROTECTED' || 'SISTEMA PROTEGIDO'}
           {status === 'THREAT' && 'AMENAZA DETECTADA'}
           {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:57:12
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
-          {status === 'THREAT' && 'AMENAZA DETECTADA'}
+          {true && 'AMENAZA DETECTADA'}
           {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
         </h2>
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] LogicalOperator
src/pages/Dashboard.jsx:57:12
           ${status === 'SCANNING' ? 'text-[var(--accent-info)]' : ''}
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
-          {status === 'THREAT' && 'AMENAZA DETECTADA'}
+          {status === 'THREAT' || 'AMENAZA DETECTADA'}
           {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
         </h2>
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] LogicalOperator
src/pages/Dashboard.jsx:58:12
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
           {status === 'THREAT' && 'AMENAZA DETECTADA'}
-          {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
+          {status === 'SCANNING' || 'ESCANEO EN CURSO...'}
         </h2>
         <p className="text-[var(--text-muted)]">Todo funciona correctamente. Tu equipo está a salvo.</p>
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Dashboard.jsx:58:12
         `}>
           {status === 'PROTECTED' && 'SISTEMA PROTEGIDO'}
           {status === 'THREAT' && 'AMENAZA DETECTADA'}
-          {status === 'SCANNING' && 'ESCANEO EN CURSO...'}
+          {true && 'ESCANEO EN CURSO...'}
         </h2>
         <p className="text-[var(--text-muted)]">Todo funciona correctamente. Tu equipo está a salvo.</p>
killedBy: Dashboard renders the SISTEMA PROTEGIDO status
statusReason: Unable to find an element with the text: SISTEMA PROTEGIDO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 max-w-5xl mx-auto space-y-6 animate-in fade-in duration-300"
    >

[Survived] StringLiteral
src/pages/Dashboard.jsx:98:74
             </div>
             <div>
               <h3 className="text-sm text-[var(--text-muted)] font-semibold uppercase">Tiempo Real</h3>
-              <p className={`text-lg font-medium mt-1 ${realtimeStatus ? 'text-[var(--accent-primary)]' : 'text-[var(--text-muted)]'}`}>
+              <p className={`text-lg font-medium mt-1 ${realtimeStatus ? "" : 'text-[var(--text-muted)]'}`}>
                 {realtimeStatus ? 'ON' : 'OFF'}
               </p>

[Survived] StringLiteral
src/pages/Dashboard.jsx:98:29
             </div>
             <div>
               <h3 className="text-sm text-[var(--text-muted)] font-semibold uppercase">Tiempo Real</h3>
-              <p className={`text-lg font-medium mt-1 ${realtimeStatus ? 'text-[var(--accent-primary)]' : 'text-[var(--text-muted)]'}`}>
+              <p className={``}>
                 {realtimeStatus ? 'ON' : 'OFF'}
               </p>

[Survived] StringLiteral
src/pages/Dashboard.jsx:105:154
           </div>
           <button 
             onClick={toggleRealtime}
-            className={`relative inline-flex h-6 w-11 items-center rounded-full transition-colors mt-2 ${realtimeStatus ? 'bg-[var(--accent-primary)]' : 'bg-[var(--border)]'}`}
+            className={`relative inline-flex h-6 w-11 items-center rounded-full transition-colors mt-2 ${realtimeStatus ? 'bg-[var(--accent-primary)]' : ""}`}
           >
             <span className={`inline-block h-4 w-4 transform rounded-full bg-white transition-transform ${realtimeStatus ? 'translate-x-6' : 'translate-x-1'}`} />

[Survived] StringLiteral
src/pages/Dashboard.jsx:107:30
             onClick={toggleRealtime}
             className={`relative inline-flex h-6 w-11 items-center rounded-full transition-colors mt-2 ${realtimeStatus ? 'bg-[var(--accent-primary)]' : 'bg-[var(--border)]'}`}
           >
-            <span className={`inline-block h-4 w-4 transform rounded-full bg-white transition-transform ${realtimeStatus ? 'translate-x-6' : 'translate-x-1'}`} />
+            <span className={``} />
           </button>
         </div>

[Killed] ArrowFunction
src/pages/Dashboard.jsx:116:20
       {/* Quick Actions */}
       <div className="grid grid-cols-2 gap-4">
         <button 
-          onClick={() => setCurrentView('scan')}
+          onClick={() => undefined}
           className="flex items-center justify-center gap-3 bg-[var(--bg-panel)] hover:bg-[var(--bg-card)] border border-[var(--border)] p-4 rounded-lg transition-colors group"
         >
killedBy: Dashboard navigates to scan view on quick scan click
statusReason: expected "vi.fn()" to be called with arguments: [ 'scan' ]

Number of calls: 0

[Killed] StringLiteral
src/pages/Dashboard.jsx:124:41
         </button>
         
         <button 
-          onClick={() => setCurrentView('scan')}
+          onClick={() => setCurrentView("")}
           className="flex items-center justify-center gap-3 bg-[var(--bg-panel)] hover:bg-[var(--bg-card)] border border-[var(--border)] p-4 rounded-lg transition-colors group"
         >
killedBy: Dashboard navigates to scan view on full scan click
statusReason: expected "vi.fn()" to be called with arguments: [ 'scan' ]

Received:

  1st vi.fn() call:

  [
-   "scan",
