[Survived] BooleanLiteral
src/pages/History.jsx:7:42
 
 export default function History() {
   const [history, setHistory] = useState([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [activeLog, setActiveLog] = useState(null);
   const [activeRecord, setActiveRecord] = useState(null);

[Killed] BlockStatement
src/pages/History.jsx:11:36
   const [activeLog, setActiveLog] = useState(null);
   const [activeRecord, setActiveRecord] = useState(null);
 
-  const fetchHistory = async () => {
-    if (window.electronAPI) {
-      setLoading(true);
-      try {
-        const data = await window.electronAPI.getScanHistory();
-        setHistory(data);
-      } catch (err) {
-        console.error("Error fetching history:", err);
-      } finally {
-        setLoading(false);
-      }
-    }
-  };
+  const fetchHistory = async () => {};
 
   useEffect(() => {
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/History.jsx:12:9
   const [activeRecord, setActiveRecord] = useState(null);
 
   const fetchHistory = async () => {
-    if (window.electronAPI) {
+    if (false) {
       setLoading(true);
       try {
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/History.jsx:12:29
   const [activeRecord, setActiveRecord] = useState(null);
 
   const fetchHistory = async () => {
-    if (window.electronAPI) {
-      setLoading(true);
-      try {
-        const data = await window.electronAPI.getScanHistory();
-        setHistory(data);
-      } catch (err) {
-        console.error("Error fetching history:", err);
-      } finally {
-        setLoading(false);
-      }
-    }
+    if (window.electronAPI) {}
   };
 
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BooleanLiteral
src/pages/History.jsx:13:18
 
   const fetchHistory = async () => {
     if (window.electronAPI) {
-      setLoading(true);
+      setLoading(false);
       try {
         const data = await window.electronAPI.getScanHistory();
killedBy: History shows loading state initially with electronAPI
statusReason: Unable to find an element with the text: Cargando historial.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/History.jsx:14:11
   const fetchHistory = async () => {
     if (window.electronAPI) {
       setLoading(true);
-      try {
-        const data = await window.electronAPI.getScanHistory();
-        setHistory(data);
-      } catch (err) {
+      try {} catch (err) {
         console.error("Error fetching history:", err);
       } finally {
killedBy: History shows loading state initially with electronAPI
statusReason: Unable to find an element with the text: Cargando historial.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/History.jsx:17:21
       try {
         const data = await window.electronAPI.getScanHistory();
         setHistory(data);
-      } catch (err) {
-        console.error("Error fetching history:", err);
-      } finally {
+      } catch (err) {} finally {
         setLoading(false);
       }

[NoCoverage] StringLiteral
src/pages/History.jsx:18:23
         const data = await window.electronAPI.getScanHistory();
         setHistory(data);
       } catch (err) {
-        console.error("Error fetching history:", err);
+        console.error("", err);
       } finally {
         setLoading(false);

[Killed] BlockStatement
src/pages/History.jsx:19:17
         setHistory(data);
       } catch (err) {
         console.error("Error fetching history:", err);
-      } finally {
-        setLoading(false);
-      }
+      } finally {}
     }
   };
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/History.jsx:25:19
     }
   };
 
-  useEffect(() => {
-    // eslint-disable-next-line react-hooks/set-state-in-effect
-    fetchHistory();
-  }, []);
+  useEffect(() => {}, []);
 
   const handleExport = async () => {
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/History.jsx:30:36
     fetchHistory();
   }, []);
 
-  const handleExport = async () => {
-    if (window.electronAPI) {
-      const res = await window.electronAPI.exportHistory();
-      if (res.success) {
-        alert('Historial exportado con éxito en: ' + res.path);
-      }
-    }
-  };
+  const handleExport = async () => {};
 
   const handleOpenLog = async (record) => {

[NoCoverage] BlockStatement
src/pages/History.jsx:31:29
   }, []);
 
   const handleExport = async () => {
-    if (window.electronAPI) {
-      const res = await window.electronAPI.exportHistory();
-      if (res.success) {
-        alert('Historial exportado con éxito en: ' + res.path);
-      }
-    }
+    if (window.electronAPI) {}
   };
 

[NoCoverage] ConditionalExpression
src/pages/History.jsx:31:9
   }, []);
 
   const handleExport = async () => {
-    if (window.electronAPI) {
+    if (true) {
       const res = await window.electronAPI.exportHistory();
       if (res.success) {

[NoCoverage] ConditionalExpression
src/pages/History.jsx:33:11
   const handleExport = async () => {
     if (window.electronAPI) {
       const res = await window.electronAPI.exportHistory();
-      if (res.success) {
+      if (false) {
         alert('Historial exportado con éxito en: ' + res.path);
       }

[NoCoverage] BlockStatement
src/pages/History.jsx:33:24
   const handleExport = async () => {
     if (window.electronAPI) {
       const res = await window.electronAPI.exportHistory();
-      if (res.success) {
-        alert('Historial exportado con éxito en: ' + res.path);
-      }
+      if (res.success) {}
     }
   };

[NoCoverage] BlockStatement
src/pages/History.jsx:39:43
     }
   };
 
-  const handleOpenLog = async (record) => {
-    if (window.electronAPI && record.log_file) {
-      const content = await window.electronAPI.readLog(record.log_file);
-      const parsedLogs = content.split('\n')
-        .filter(line => line.trim() !== '')
-        .map(line => {
-          const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);
-          const level = match ? match[1] : 'INFO';
-          return { level, rawLine: line };
-        });
-      setActiveLog(parsedLogs);
-      setActiveRecord(record);
-    }
-  };
+  const handleOpenLog = async (record) => {};
 
   const getStatusBadge = (status) => {

[NoCoverage] ConditionalExpression
src/pages/History.jsx:40:9
   };
 
   const handleOpenLog = async (record) => {
-    if (window.electronAPI && record.log_file) {
+    if (false) {
       const content = await window.electronAPI.readLog(record.log_file);
       const parsedLogs = content.split('\n')

[NoCoverage] ConditionalExpression
src/pages/History.jsx:40:9
   };
 
   const handleOpenLog = async (record) => {
-    if (window.electronAPI && record.log_file) {
+    if (true) {
       const content = await window.electronAPI.readLog(record.log_file);
       const parsedLogs = content.split('\n')

[NoCoverage] MethodExpression
src/pages/History.jsx:42:26
   const handleOpenLog = async (record) => {
     if (window.electronAPI && record.log_file) {
       const content = await window.electronAPI.readLog(record.log_file);
-      const parsedLogs = content.split('\n')
-        .filter(line => line.trim() !== '')
+      const parsedLogs = content.split('\n')
         .map(line => {
           const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);

[NoCoverage] EqualityOperator
src/pages/History.jsx:43:25
     if (window.electronAPI && record.log_file) {
       const content = await window.electronAPI.readLog(record.log_file);
       const parsedLogs = content.split('\n')
-        .filter(line => line.trim() !== '')
+        .filter(line => line.trim() === '')
         .map(line => {
           const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);

[NoCoverage] ArrowFunction
src/pages/History.jsx:43:17
     if (window.electronAPI && record.log_file) {
       const content = await window.electronAPI.readLog(record.log_file);
       const parsedLogs = content.split('\n')
-        .filter(line => line.trim() !== '')
+        .filter(() => undefined)
         .map(line => {
           const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);

[NoCoverage] BlockStatement
src/pages/History.jsx:44:22
       const content = await window.electronAPI.readLog(record.log_file);
       const parsedLogs = content.split('\n')
         .filter(line => line.trim() !== '')
-        .map(line => {
-          const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);
-          const level = match ? match[1] : 'INFO';
-          return { level, rawLine: line };
-        });
+        .map(line => {});
       setActiveLog(parsedLogs);
       setActiveRecord(record);

[NoCoverage] StringLiteral
src/pages/History.jsx:46:44
         .filter(line => line.trim() !== '')
         .map(line => {
           const match = line.match(/^\[.*?\]\s+\[(.*?)\]/);
-          const level = match ? match[1] : 'INFO';
+          const level = match ? match[1] : "";
           return { level, rawLine: line };
         });

[NoCoverage] StringLiteral
src/pages/History.jsx:60:12
       case 'running':
-      case 'error':
+      case "":
       default:

[NoCoverage] ConditionalExpression
src/pages/History.jsx:62:7
       case 'error':
-      default:
-        return <span className="inline-flex items-center gap-1.5 px-2 py-1 rounded text-xs font-medium bg-[var(--bg-card)] text-[var(--text-muted)] border border-[var(--border)]">{status}</span>;
+      default:
     }
   };

[Killed] BlockStatement
src/pages/History.jsx:67:38
     }
   };
 
-  const getScanTypeLabel = (type) => {
-    const labels = { 'quick': 'Rápido', 'full': 'Completo', 'file': 'Carpeta/Archivo' };
-    return labels[type] || type;
-  };
+  const getScanTypeLabel = (type) => {};
 
   return (
killedBy: History renders history records in table
statusReason: Unable to find an element with the text: Rápido. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] StringLiteral
src/pages/History.jsx:68:49
   };
 
   const getScanTypeLabel = (type) => {
-    const labels = { 'quick': 'Rápido', 'full': 'Completo', 'file': 'Carpeta/Archivo' };
+    const labels = { 'quick': 'Rápido', 'full': "", 'file': 'Carpeta/Archivo' };
     return labels[type] || type;
   };
killedBy: History shows correct status badges
statusReason: Unable to find an element with the text: Completo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ObjectLiteral
src/pages/History.jsx:68:20
   };
 
   const getScanTypeLabel = (type) => {
-    const labels = { 'quick': 'Rápido', 'full': 'Completo', 'file': 'Carpeta/Archivo' };
+    const labels = {};
     return labels[type] || type;
   };
killedBy: History renders history records in table
statusReason: Unable to find an element with the text: Rápido. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] LogicalOperator
src/pages/History.jsx:69:12
 
   const getScanTypeLabel = (type) => {
     const labels = { 'quick': 'Rápido', 'full': 'Completo', 'file': 'Carpeta/Archivo' };
-    return labels[type] || type;
+    return labels[type] && type;
   };
 
killedBy: History renders history records in table
statusReason: Unable to find an element with the text: Rápido. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/History.jsx:69:12
 
   const getScanTypeLabel = (type) => {
     const labels = { 'quick': 'Rápido', 'full': 'Completo', 'file': 'Carpeta/Archivo' };
-    return labels[type] || type;
+    return false;
   };
 
killedBy: History renders history records in table
statusReason: Unable to find an element with the text: Rápido. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/History.jsx:102:13
           <div className="flex-1 flex justify-center items-center text-[var(--text-muted)]">
             Cargando historial...
           </div>
-        ) : history.length === 0 ? (
+        ) : true ? (
           <div className="flex-1 flex flex-col justify-center items-center text-[var(--text-muted)] p-8 text-center">
             <Search size={48} className="mb-4 opacity-20" />
killedBy: History renders history records in table
statusReason: Unable to find an element with the text: Rápido. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/History.jsx:102:13
           <div className="flex-1 flex justify-center items-center text-[var(--text-muted)]">
             Cargando historial...
           </div>
-        ) : history.length === 0 ? (
+        ) : false ? (
           <div className="flex-1 flex flex-col justify-center items-center text-[var(--text-muted)] p-8 text-center">
             <Search size={48} className="mb-4 opacity-20" />
killedBy: History shows empty state message after loading
statusReason: Unable to find an element with the text: No hay escaneos. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] StringLiteral
src/pages/History.jsx:132:93
                       {new Date(record.started_at).toLocaleString()}
                     </td>
                     <td className="px-6 py-4 text-[var(--text-muted)] whitespace-nowrap">
-                      {record.finished_at ? new Date(record.finished_at).toLocaleString() : '-'}
+                      {record.finished_at ? new Date(record.finished_at).toLocaleString() : ""}
                     </td>
                     <td className="px-6 py-4 text-center text-[var(--text-primary)] font-mono">
killedBy: History shows dash for missing finished_at
statusReason: Unable to find an element with the text: -. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Survived] ConditionalExpression
src/pages/History.jsx:138:63
                       {record.files_scanned.toLocaleString()}
                     </td>
                     <td className="px-6 py-4 text-center">
-                      <span className={`font-mono font-bold ${record.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
+                      <span className={`font-mono font-bold ${false ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
                         {record.threats_found}
                       </span>

[Survived] ConditionalExpression
src/pages/History.jsx:138:63
                       {record.files_scanned.toLocaleString()}
                     </td>
                     <td className="px-6 py-4 text-center">
-                      <span className={`font-mono font-bold ${record.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
+                      <span className={`font-mono font-bold ${true ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
                         {record.threats_found}
                       </span>

[Survived] ConditionalExpression
src/pages/History.jsx:146:24
                       {getStatusBadge(record.status)}
                     </td>
                     <td className="px-6 py-4 flex justify-end">
-                      {record.log_file && (
-                        <button 
-                          onClick={() => handleOpenLog(record)}
-                          className="p-2 text-[var(--text-muted)] hover:text-[var(--accent-info)] transition-colors rounded hover:bg-[var(--accent-info)]/10"
-                          title="Abrir archivo de log"
-                        >
-                          <FileText size={18} />
-                        </button>
-                      )}
+                      {false}
                     </td>
                   </tr>

[Survived] ConditionalExpression
src/pages/History.jsx:146:24
                       {getStatusBadge(record.status)}
                     </td>
                     <td className="px-6 py-4 flex justify-end">
-                      {record.log_file && (
-                        <button 
-                          onClick={() => handleOpenLog(record)}
-                          className="p-2 text-[var(--text-muted)] hover:text-[var(--accent-info)] transition-colors rounded hover:bg-[var(--accent-info)]/10"
-                          title="Abrir archivo de log"
-                        >
-                          <FileText size={18} />
-                        </button>
-                      )}
+                      {true}
                     </td>
                   </tr>

[NoCoverage] ArrowFunction
src/pages/History.jsx:148:36
                     <td className="px-6 py-4 flex justify-end">
                       {record.log_file && (
                         <button 
-                          onClick={() => handleOpenLog(record)}
+                          onClick={() => undefined}
                           className="p-2 text-[var(--text-muted)] hover:text-[var(--accent-info)] transition-colors rounded hover:bg-[var(--accent-info)]/10"
                           title="Abrir archivo de log"

[NoCoverage] BlockStatement
src/pages/History.jsx:173:38
                 <FileText size={18} className="text-[var(--accent-info)]" />
                 Registro del Escaneo
               </h2>
-              <button onClick={() => { setActiveLog(null); setActiveRecord(null); }} className="text-[var(--text-muted)] hover:text-white transition-colors">
+              <button onClick={() => {}} className="text-[var(--text-muted)] hover:text-white transition-colors">
                 <X size={20} />
               </button>

[NoCoverage] LogicalOperator
src/pages/History.jsx:178:14
               </button>
             </div>
             
-            {activeRecord && (
-              <div className="p-4 bg-[var(--bg-base)] border-b border-[var(--border)] grid grid-cols-2 md:grid-cols-4 gap-4 text-sm">
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Tipo de Escaneo</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{getScanTypeLabel(activeRecord.scan_type)}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Fecha y Hora</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{new Date(activeRecord.started_at).toLocaleString()}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Archivos Analizados</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{activeRecord.files_scanned.toLocaleString()}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Amenazas</p>
-                  <p className={`font-bold mt-1 ${activeRecord.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
-                    {activeRecord.threats_found}
-                  </p>
-                </div>
-              </div>
-            )}
+            {activeRecord || <div className="p-4 bg-[var(--bg-base)] border-b border-[var(--border)] grid grid-cols-2 md:grid-cols-4 gap-4 text-sm">
+                <div>
+                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Tipo de Escaneo</p>
+                  <p className="font-medium text-[var(--text-primary)] mt-1">{getScanTypeLabel(activeRecord.scan_type)}</p>
+                </div>
+                <div>
+                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Fecha y Hora</p>
+                  <p className="font-medium text-[var(--text-primary)] mt-1">{new Date(activeRecord.started_at).toLocaleString()}</p>
+                </div>
+                <div>
+                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Archivos Analizados</p>
+                  <p className="font-medium text-[var(--text-primary)] mt-1">{activeRecord.files_scanned.toLocaleString()}</p>
+                </div>
+                <div>
+                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Amenazas</p>
+                  <p className={`font-bold mt-1 ${activeRecord.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
+                    {activeRecord.threats_found}
+                  </p>
+                </div>
+              </div>}
 
             <div className="flex-1 overflow-hidden p-4">

[NoCoverage] ConditionalExpression
src/pages/History.jsx:178:14
               </button>
             </div>
             
-            {activeRecord && (
-              <div className="p-4 bg-[var(--bg-base)] border-b border-[var(--border)] grid grid-cols-2 md:grid-cols-4 gap-4 text-sm">
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Tipo de Escaneo</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{getScanTypeLabel(activeRecord.scan_type)}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Fecha y Hora</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{new Date(activeRecord.started_at).toLocaleString()}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Archivos Analizados</p>
-                  <p className="font-medium text-[var(--text-primary)] mt-1">{activeRecord.files_scanned.toLocaleString()}</p>
-                </div>
-                <div>
-                  <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Amenazas</p>
-                  <p className={`font-bold mt-1 ${activeRecord.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
-                    {activeRecord.threats_found}
-                  </p>
-                </div>
-              </div>
-            )}
+            {false}
 
             <div className="flex-1 overflow-hidden p-4">

[NoCoverage] ConditionalExpression
src/pages/History.jsx:194:51
                 </div>
                 <div>
                   <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Amenazas</p>
-                  <p className={`font-bold mt-1 ${activeRecord.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
+                  <p className={`font-bold mt-1 ${true ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
                     {activeRecord.threats_found}
                   </p>

[NoCoverage] EqualityOperator
src/pages/History.jsx:194:51
                 </div>
                 <div>
                   <p className="text-[var(--text-muted)] text-xs uppercase font-semibold tracking-wider">Amenazas</p>
-                  <p className={`font-bold mt-1 ${activeRecord.threats_found > 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
+                  <p className={`font-bold mt-1 ${activeRecord.threats_found <= 0 ? 'text-[var(--accent-danger)]' : 'text-[var(--accent-primary)]'}`}>
                     {activeRecord.threats_found}
                   </p>
