[Survived] ArrayDeclaration
src/pages/Scan.jsx:7:36
 import ThreatModal from '../components/ThreatModal';
 
 export default function Scan() {
-  const [logs, setLogs] = useState([]);
+  const [logs, setLogs] = useState(["Stryker was here"]);
   const [activeScanType, setActiveScanType] = useState(null);
   const [activeThreat, setActiveThreat] = useState(null);

[Killed] BlockStatement
src/pages/Scan.jsx:11:19
   const [activeScanType, setActiveScanType] = useState(null);
   const [activeThreat, setActiveThreat] = useState(null);
 
-  useEffect(() => {
-    if (window.electronAPI) {
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
-
-      // Also listen to real-time threats here if needed, or handle in Layout.
-      // But for Scan view, threats found during manual scan are just logged.
-      // We can also trigger the modal if we want.
-      window.electronAPI.onThreatDetected((threat) => {
-        setActiveThreat(threat);
-      });
-    }
-  }, []);
+  useEffect(() => {}, []);
 
   const handleCancelScan = async () => {
killedBy: Scan registers log and threat listeners when electronAPI is available
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/pages/Scan.jsx:12:29
   const [activeThreat, setActiveThreat] = useState(null);
 
   useEffect(() => {
-    if (window.electronAPI) {
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
-
-      // Also listen to real-time threats here if needed, or handle in Layout.
-      // But for Scan view, threats found during manual scan are just logged.
-      // We can also trigger the modal if we want.
-      window.electronAPI.onThreatDetected((threat) => {
-        setActiveThreat(threat);
-      });
-    }
+    if (window.electronAPI) {}
   }, []);
 
killedBy: Scan registers log and threat listeners when electronAPI is available
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/pages/Scan.jsx:12:9
   const [activeThreat, setActiveThreat] = useState(null);
 
   useEffect(() => {
-    if (window.electronAPI) {
+    if (true) {
       window.electronAPI.onLogMessage((log) => {
         setLogs(prev => [...prev, log]);
killedBy: Scan renders the scan center heading
statusReason: Cannot read properties of undefined (reading 'onLogMessage')

[NoCoverage] BlockStatement
src/pages/Scan.jsx:13:48
 
   useEffect(() => {
     if (window.electronAPI) {
-      window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
-      });
+      window.electronAPI.onLogMessage((log) => {});
 
       // Also listen to real-time threats here if needed, or handle in Layout.

[NoCoverage] ArrowFunction
src/pages/Scan.jsx:14:17
   useEffect(() => {
     if (window.electronAPI) {
       window.electronAPI.onLogMessage((log) => {
-        setLogs(prev => [...prev, log]);
+        setLogs(() => undefined);
       });
 

[NoCoverage] BlockStatement
src/pages/Scan.jsx:20:55
       // Also listen to real-time threats here if needed, or handle in Layout.
       // But for Scan view, threats found during manual scan are just logged.
       // We can also trigger the modal if we want.
-      window.electronAPI.onThreatDetected((threat) => {
-        setActiveThreat(threat);
-      });
+      window.electronAPI.onThreatDetected((threat) => {});
     }
   }, []);

[NoCoverage] BlockStatement
src/pages/Scan.jsx:26:40
     }
   }, []);
 
-  const handleCancelScan = async () => {
-    if (window.electronAPI) {
-      const canceled = await window.electronAPI.cancelScan();
-      if (canceled) {
-        setActiveScanType(null);
-      }
-    }
-  };
+  const handleCancelScan = async () => {};
 
   const handleScanQuick = async () => {

[NoCoverage] BlockStatement
src/pages/Scan.jsx:27:29
   }, []);
 
   const handleCancelScan = async () => {
-    if (window.electronAPI) {
-      const canceled = await window.electronAPI.cancelScan();
-      if (canceled) {
-        setActiveScanType(null);
-      }
-    }
+    if (window.electronAPI) {}
   };
 

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:27:9
   }, []);
 
   const handleCancelScan = async () => {
-    if (window.electronAPI) {
+    if (true) {
       const canceled = await window.electronAPI.cancelScan();
       if (canceled) {

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:29:11
   const handleCancelScan = async () => {
     if (window.electronAPI) {
       const canceled = await window.electronAPI.cancelScan();
-      if (canceled) {
+      if (true) {
         setActiveScanType(null);
       }

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:29:11
   const handleCancelScan = async () => {
     if (window.electronAPI) {
       const canceled = await window.electronAPI.cancelScan();
-      if (canceled) {
+      if (false) {
         setActiveScanType(null);
       }

[Killed] BlockStatement
src/pages/Scan.jsx:35:39
     }
   };
 
-  const handleScanQuick = async () => {
-    if (activeScanType) return;
-    setActiveScanType('quick');
-    setLogs([]);
-    try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanQuick();
-      }
-    } catch (err) {
-      console.error(err);
-    } finally {
-      setActiveScanType(null);
-    }
-  };
+  const handleScanQuick = async () => {};
 
   const handleScanFull = async () => {
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Scan.jsx:36:9
   };
 
   const handleScanQuick = async () => {
-    if (activeScanType) return;
+    if (true) return;
     setActiveScanType('quick');
     setLogs([]);
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Survived] ConditionalExpression
src/pages/Scan.jsx:36:9
   };
 
   const handleScanQuick = async () => {
-    if (activeScanType) return;
+    if (false) return;
     setActiveScanType('quick');
     setLogs([]);

[Killed] StringLiteral
src/pages/Scan.jsx:37:23
 
   const handleScanQuick = async () => {
     if (activeScanType) return;
-    setActiveScanType('quick');
+    setActiveScanType("");
     setLogs([]);
     try {
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Scan.jsx:39:9
     if (activeScanType) return;
     setActiveScanType('quick');
     setLogs([]);
-    try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanQuick();
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error(err);
     } finally {
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] BlockStatement
src/pages/Scan.jsx:40:31
     setActiveScanType('quick');
     setLogs([]);
     try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanQuick();
-      }
+      if (window.electronAPI) {}
     } catch (err) {
       console.error(err);
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Killed] ConditionalExpression
src/pages/Scan.jsx:40:11
     setActiveScanType('quick');
     setLogs([]);
     try {
-      if (window.electronAPI) {
+      if (false) {
         await window.electronAPI.scanQuick();
       }
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[NoCoverage] BlockStatement
src/pages/Scan.jsx:43:19
       if (window.electronAPI) {
         await window.electronAPI.scanQuick();
       }
-    } catch (err) {
-      console.error(err);
-    } finally {
+    } catch (err) {} finally {
       setActiveScanType(null);
     }

[Survived] BlockStatement
src/pages/Scan.jsx:45:15
       }
     } catch (err) {
       console.error(err);
-    } finally {
-      setActiveScanType(null);
-    }
+    } finally {}
   };
 

[NoCoverage] BlockStatement
src/pages/Scan.jsx:50:38
     }
   };
 
-  const handleScanFull = async () => {
-    if (activeScanType) return;
-    setActiveScanType('full');
-    setLogs([]);
-    try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanFull();
-      }
-    } catch (err) {
-      console.error(err);
-    } finally {
-      setActiveScanType(null);
-    }
-  };
+  const handleScanFull = async () => {};
 
   const handleScanFolder = async () => {

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:51:9
   };
 
   const handleScanFull = async () => {
-    if (activeScanType) return;
+    if (false) return;
     setActiveScanType('full');
     setLogs([]);

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:51:9
   };
 
   const handleScanFull = async () => {
-    if (activeScanType) return;
+    if (true) return;
     setActiveScanType('full');
     setLogs([]);

[NoCoverage] StringLiteral
src/pages/Scan.jsx:52:23
 
   const handleScanFull = async () => {
     if (activeScanType) return;
-    setActiveScanType('full');
+    setActiveScanType("");
     setLogs([]);
     try {

[NoCoverage] BlockStatement
src/pages/Scan.jsx:54:9
     if (activeScanType) return;
     setActiveScanType('full');
     setLogs([]);
-    try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanFull();
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error(err);
     } finally {

[NoCoverage] BlockStatement
src/pages/Scan.jsx:55:31
     setActiveScanType('full');
     setLogs([]);
     try {
-      if (window.electronAPI) {
-        await window.electronAPI.scanFull();
-      }
+      if (window.electronAPI) {}
     } catch (err) {
       console.error(err);

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:55:11
     setActiveScanType('full');
     setLogs([]);
     try {
-      if (window.electronAPI) {
+      if (true) {
         await window.electronAPI.scanFull();
       }

[NoCoverage] BlockStatement
src/pages/Scan.jsx:65:40
     }
   };
 
-  const handleScanFolder = async () => {
-    if (activeScanType) return;
-    if (window.electronAPI) {
-      const folderPath = await window.electronAPI.selectFolder();
-      if (!folderPath) return;
-
-      setActiveScanType('folder');
-      setLogs([]);
-      try {
-        await window.electronAPI.scanTarget(folderPath);
-      } catch (err) {
-        console.error(err);
-      } finally {
-        setActiveScanType(null);
-      }
-    }
-  };
+  const handleScanFolder = async () => {};
 
   const handleQuarantine = async (threat) => {

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:66:9
   };
 
   const handleScanFolder = async () => {
-    if (activeScanType) return;
+    if (true) return;
     if (window.electronAPI) {
       const folderPath = await window.electronAPI.selectFolder();

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:66:9
   };
 
   const handleScanFolder = async () => {
-    if (activeScanType) return;
+    if (false) return;
     if (window.electronAPI) {
       const folderPath = await window.electronAPI.selectFolder();

[NoCoverage] BlockStatement
src/pages/Scan.jsx:67:29
 
   const handleScanFolder = async () => {
     if (activeScanType) return;
-    if (window.electronAPI) {
-      const folderPath = await window.electronAPI.selectFolder();
-      if (!folderPath) return;
-
-      setActiveScanType('folder');
-      setLogs([]);
-      try {
-        await window.electronAPI.scanTarget(folderPath);
-      } catch (err) {
-        console.error(err);
-      } finally {
-        setActiveScanType(null);
-      }
-    }
+    if (window.electronAPI) {}
   };
 

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:67:9
 
   const handleScanFolder = async () => {
     if (activeScanType) return;
-    if (window.electronAPI) {
+    if (false) {
       const folderPath = await window.electronAPI.selectFolder();
       if (!folderPath) return;

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:69:11
     if (activeScanType) return;
     if (window.electronAPI) {
       const folderPath = await window.electronAPI.selectFolder();
-      if (!folderPath) return;
+      if (true) return;
 
       setActiveScanType('folder');

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:69:11
     if (activeScanType) return;
     if (window.electronAPI) {
       const folderPath = await window.electronAPI.selectFolder();
-      if (!folderPath) return;
+      if (false) return;
 
       setActiveScanType('folder');

[NoCoverage] BlockStatement
src/pages/Scan.jsx:73:11
 
       setActiveScanType('folder');
       setLogs([]);
-      try {
-        await window.electronAPI.scanTarget(folderPath);
-      } catch (err) {
+      try {} catch (err) {
         console.error(err);
       } finally {

[NoCoverage] BlockStatement
src/pages/Scan.jsx:75:21
       setLogs([]);
       try {
         await window.electronAPI.scanTarget(folderPath);
-      } catch (err) {
-        console.error(err);
-      } finally {
+      } catch (err) {} finally {
         setActiveScanType(null);
       }

[NoCoverage] BlockStatement
src/pages/Scan.jsx:83:46
     }
   };
 
-  const handleQuarantine = async (threat) => {
-    if (window.electronAPI) {
-      await window.electronAPI.quarantineFile(threat.file, threat.threatName);
-    }
-    setActiveThreat(null);
-  };
+  const handleQuarantine = async (threat) => {};
 
   return (

[NoCoverage] ConditionalExpression
src/pages/Scan.jsx:84:9
   };
 
   const handleQuarantine = async (threat) => {
-    if (window.electronAPI) {
+    if (false) {
       await window.electronAPI.quarantineFile(threat.file, threat.threatName);
     }

[NoCoverage] BlockStatement
src/pages/Scan.jsx:84:29
   };
 
   const handleQuarantine = async (threat) => {
-    if (window.electronAPI) {
-      await window.electronAPI.quarantineFile(threat.file, threat.threatName);
-    }
+    if (window.electronAPI) {}
     setActiveThreat(null);
   };

[Killed] BooleanLiteral
src/pages/Scan.jsx:113:22
       <div className="grid grid-cols-3 gap-4 mb-6">
         <button 
           onClick={handleScanQuick}
-          disabled={!!activeScanType}
+          disabled={!activeScanType}
         >
killedBy: Scan starts quick scan and shows cancel button with electronAPI
statusReason: Unable to find an element with the text: Detener Escaneo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-8 h-full flex flex-col max-w-5xl mx-auto animate-in fade-in duration-300"
    >

[Survived] BooleanLiteral
src/pages/Scan.jsx:125:21
 
         <button 
           onClick={handleScanFull}
-          disabled={!!activeScanType}
+          disabled={!activeScanType}
         >

[Survived] BooleanLiteral
src/pages/Scan.jsx:137:22
 
         <button 
           onClick={handleScanFolder}
-          disabled={!!activeScanType}
+          disabled={!activeScanType}
         >

[Survived] ArrowFunction
src/pages/Scan.jsx:156:19
       <ThreatModal 
         threat={activeThreat} 
         onQuarantine={handleQuarantine} 
-        onIgnore={() => setActiveThreat(null)} 
+        onIgnore={() => undefined} 
       />
 
