[Killed] BooleanLiteral
src/components/RansomwareAlertModal.jsx:4:7
 import { AlertTriangle } from 'lucide-react';
 
 export default function RansomwareAlertModal({ data, onDismiss }) {
-  if (!data) return null;
+  if (data) return null;
 
   return (
killedBy: RansomwareAlertModal renders nothing when data is null
statusReason: Cannot read properties of null (reading 'filePath')

[Killed] ConditionalExpression
src/components/RansomwareAlertModal.jsx:4:7
 import { AlertTriangle } from 'lucide-react';
 
 export default function RansomwareAlertModal({ data, onDismiss }) {
-  if (!data) return null;
+  if (false) return null;
 
   return (
killedBy: RansomwareAlertModal renders nothing when data is null
statusReason: Cannot read properties of null (reading 'filePath')
