[Killed] StringLiteral
src/components/Sidebar.jsx:6:31
 
 export default function Sidebar({ currentView, setCurrentView }) {
   const menuItems = [
-    { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
+    { id: 'dashboard', label: "", icon: LayoutDashboard },
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
killedBy: Sidebar renders all menu items
statusReason: Unable to find an element with the text: Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-[200px] bg-[var(--bg-panel)] h-full flex flex-col border-r border-[var(--border)]"
    >

[Killed] ObjectLiteral
src/components/Sidebar.jsx:6:5
 
 export default function Sidebar({ currentView, setCurrentView }) {
   const menuItems = [
-    { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
+    {},
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
killedBy: Sidebar renders all menu items
statusReason: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Sidebar`.

[Killed] StringLiteral
src/components/Sidebar.jsx:7:11
 export default function Sidebar({ currentView, setCurrentView }) {
   const menuItems = [
     { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
-    { id: 'scan', label: 'Escaneo', icon: ScanSearch },
+    { id: "", label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
     { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
killedBy: Sidebar highlights the active menu item
statusReason: expected 'flex items-center gap-3 px-4 py-3 rou…' to contain 'text-[var(--accent-primary)]'

[Killed] ObjectLiteral
src/components/Sidebar.jsx:8:5
   const menuItems = [
     { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
-    { id: 'realtime', label: 'Tiempo Real', icon: Activity },
+    {},
     { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
     { id: 'history', label: 'Historial', icon: History },
killedBy: Sidebar renders all menu items
statusReason: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Sidebar`.

[Killed] StringLiteral
src/components/Sidebar.jsx:8:11
   const menuItems = [
     { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
-    { id: 'realtime', label: 'Tiempo Real', icon: Activity },
+    { id: "", label: 'Tiempo Real', icon: Activity },
     { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
     { id: 'history', label: 'Historial', icon: History },
killedBy: Sidebar calls setCurrentView with correct id for each item
statusReason: expected "vi.fn()" to be called with arguments: [ 'realtime' ]

Received:

  1st vi.fn() call:

  [
-   "realtime",

[Killed] StringLiteral
src/components/Sidebar.jsx:9:32
     { id: 'dashboard', label: 'Dashboard', icon: LayoutDashboard },
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
-    { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
+    { id: 'quarantine', label: "", icon: ShieldAlert },
     { id: 'history', label: 'Historial', icon: History },
   ];
killedBy: Sidebar renders all menu items
statusReason: Unable to find an element with the text: Cuarentena. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-[200px] bg-[var(--bg-panel)] h-full flex flex-col border-r border-[var(--border)]"
    >

[Killed] ObjectLiteral
src/components/Sidebar.jsx:10:5
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
     { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
-    { id: 'history', label: 'Historial', icon: History },
+    {},
   ];
 
killedBy: Sidebar renders all menu items
statusReason: Element type is invalid: expected a string (for built-in components) or a class/function (for composite components) but got: undefined. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.

Check the render method of `Sidebar`.

[Killed] StringLiteral
src/components/Sidebar.jsx:10:11
     { id: 'scan', label: 'Escaneo', icon: ScanSearch },
     { id: 'realtime', label: 'Tiempo Real', icon: Activity },
     { id: 'quarantine', label: 'Cuarentena', icon: ShieldAlert },
-    { id: 'history', label: 'Historial', icon: History },
+    { id: "", label: 'Historial', icon: History },
   ];
 
killedBy: Sidebar calls setCurrentView with correct id for each item
statusReason: expected "vi.fn()" to be called with arguments: [ 'history' ]

Received:

  1st vi.fn() call:

  [
-   "history",

[Killed] BlockStatement
src/components/Sidebar.jsx:16:34
   return (
     <div className="w-[200px] bg-[var(--bg-panel)] h-full flex flex-col border-r border-[var(--border)]">
       <div className="flex-1 py-6 px-3 flex flex-col gap-2">
-        {menuItems.map((item) => {
-          const Icon = item.icon;
-          const isActive = currentView === item.id;
-          
-          return (
-            <button
-              key={item.id}
-              onClick={() => setCurrentView(item.id)}
-              className={`flex items-center gap-3 px-4 py-3 rounded-md transition-all text-sm font-medium
-                ${isActive 
-                  ? 'bg-[var(--accent-primary)]/10 text-[var(--accent-primary)]' 
-                  : 'text-[var(--text-muted)] hover:bg-[var(--bg-card)] hover:text-[var(--text-primary)]'
-                }`}
-            >
-              <Icon size={18} className={isActive ? 'text-[var(--accent-primary)]' : ''} />
-              {item.label}
-            </button>
-          );
-        })}
+        {menuItems.map((item) => {})}
       </div>
 
killedBy: Sidebar renders all menu items
statusReason: Unable to find an element with the text: Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-[200px] bg-[var(--bg-panel)] h-full flex flex-col border-r border-[var(--border)]"
    >

[Killed] EqualityOperator
src/components/Sidebar.jsx:18:28
       <div className="flex-1 py-6 px-3 flex flex-col gap-2">
         {menuItems.map((item) => {
           const Icon = item.icon;
-          const isActive = currentView === item.id;
+          const isActive = currentView !== item.id;
           
           return (
killedBy: Sidebar highlights the active menu item
statusReason: expected 'flex items-center gap-3 px-4 py-3 rou…' to contain 'text-[var(--accent-primary)]'

[Killed] ConditionalExpression
src/components/Sidebar.jsx:18:28
       <div className="flex-1 py-6 px-3 flex flex-col gap-2">
         {menuItems.map((item) => {
           const Icon = item.icon;
-          const isActive = currentView === item.id;
+          const isActive = false;
           
           return (
killedBy: Sidebar highlights the active menu item
statusReason: expected 'flex items-center gap-3 px-4 py-3 rou…' to contain 'text-[var(--accent-primary)]'

[Killed] ArrowFunction
src/components/Sidebar.jsx:23:24
           return (
             <button
               key={item.id}
-              onClick={() => setCurrentView(item.id)}
+              onClick={() => undefined}
               className={`flex items-center gap-3 px-4 py-3 rounded-md transition-all text-sm font-medium
                 ${isActive 
killedBy: Sidebar calls setCurrentView when clicking a menu item
statusReason: expected "vi.fn()" to be called with arguments: [ 'scan' ]

Number of calls: 0

[Killed] StringLiteral
src/components/Sidebar.jsx:24:26
             <button
               key={item.id}
               onClick={() => setCurrentView(item.id)}
-              className={`flex items-center gap-3 px-4 py-3 rounded-md transition-all text-sm font-medium
-                ${isActive 
-                  ? 'bg-[var(--accent-primary)]/10 text-[var(--accent-primary)]' 
-                  : 'text-[var(--text-muted)] hover:bg-[var(--bg-card)] hover:text-[var(--text-primary)]'
-                }`}
+              className={``}
             >
               <Icon size={18} className={isActive ? 'text-[var(--accent-primary)]' : ''} />
killedBy: Sidebar highlights the active menu item
statusReason: expected '' to contain 'text-[var(--accent-primary)]'

[Killed] StringLiteral
src/components/Sidebar.jsx:27:21
               className={`flex items-center gap-3 px-4 py-3 rounded-md transition-all text-sm font-medium
                 ${isActive 
                   ? 'bg-[var(--accent-primary)]/10 text-[var(--accent-primary)]' 
-                  : 'text-[var(--text-muted)] hover:bg-[var(--bg-card)] hover:text-[var(--text-primary)]'
+                  : ""
                 }`}
             >
killedBy: Sidebar does not highlight inactive menu items as active
statusReason: expected 'flex items-center gap-3 px-4 py-3 rou…' to contain 'text-[var(--text-muted)]'

[Survived] StringLiteral
src/components/Sidebar.jsx:30:86
                   : 'text-[var(--text-muted)] hover:bg-[var(--bg-card)] hover:text-[var(--text-primary)]'
                 }`}
             >
-              <Icon size={18} className={isActive ? 'text-[var(--accent-primary)]' : ''} />
+              <Icon size={18} className={isActive ? 'text-[var(--accent-primary)]' : "Stryker was here!"} />
               {item.label}
             </button>

[Survived] StringLiteral
src/components/Sidebar.jsx:30:53
                   : 'text-[var(--text-muted)] hover:bg-[var(--bg-card)] hover:text-[var(--text-primary)]'
                 }`}
             >
-              <Icon size={18} className={isActive ? 'text-[var(--accent-primary)]' : ''} />
+              <Icon size={18} className={isActive ? "" : ''} />
               {item.label}
             </button>
