[Killed] BooleanLiteral
src/components/ThreatModal.jsx:5:7
 import { AlertTriangle } from 'lucide-react';
 
 export default function ThreatModal({ threat, onQuarantine, onIgnore }) {
-  if (!threat) return null;
+  if (threat) return null;
 
   return (
killedBy: ThreatModal renders nothing when threat is null
statusReason: Cannot read properties of null (reading 'threatName')

[Killed] ConditionalExpression
src/components/ThreatModal.jsx:5:7
 import { AlertTriangle } from 'lucide-react';
 
 export default function ThreatModal({ threat, onQuarantine, onIgnore }) {
-  if (!threat) return null;
+  if (false) return null;
 
   return (
killedBy: ThreatModal renders nothing when threat is null
statusReason: Cannot read properties of null (reading 'threatName')

[Killed] ArrowFunction
src/components/ThreatModal.jsx:52:22
             Ignorar
           </button>
           <button 
-            onClick={() => onQuarantine(threat)}
+            onClick={() => undefined}
             className="px-4 py-2 text-sm font-medium text-white bg-[var(--accent-danger)] hover:bg-red-600 rounded transition-colors"
           >
killedBy: ThreatModal calls onQuarantine with threat data when quarantine button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0
