[Killed] BlockStatement
src/components/Titlebar.jsx:5:32
 import { Minus, Square, X, Shield } from 'lucide-react';
 
 export default function Titlebar() {
-  const handleMinimize = () => {
-    if (window.electronAPI) window.electronAPI.minimizeWindow();
-  };
+  const handleMinimize = () => {};
 
   const handleMaximize = () => {
killedBy: Titlebar calls electronAPI.minimizeWindow on minimize click
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/components/Titlebar.jsx:6:9
 
 export default function Titlebar() {
   const handleMinimize = () => {
-    if (window.electronAPI) window.electronAPI.minimizeWindow();
+    if (false) window.electronAPI.minimizeWindow();
   };
 
killedBy: Titlebar calls electronAPI.minimizeWindow on minimize click
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/components/Titlebar.jsx:9:32
     if (window.electronAPI) window.electronAPI.minimizeWindow();
   };
 
-  const handleMaximize = () => {
-    if (window.electronAPI) window.electronAPI.maximizeWindow();
-  };
+  const handleMaximize = () => {};
 
   const handleClose = () => {
killedBy: Titlebar calls electronAPI.maximizeWindow on maximize click
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/components/Titlebar.jsx:10:9
   };
 
   const handleMaximize = () => {
-    if (window.electronAPI) window.electronAPI.maximizeWindow();
+    if (false) window.electronAPI.maximizeWindow();
   };
 
killedBy: Titlebar calls electronAPI.maximizeWindow on maximize click
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/components/Titlebar.jsx:13:29
     if (window.electronAPI) window.electronAPI.maximizeWindow();
   };
 
-  const handleClose = () => {
-    if (window.electronAPI) window.electronAPI.closeWindow();
-  };
+  const handleClose = () => {};
 
   return (
killedBy: Titlebar calls electronAPI.closeWindow on close click
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/components/Titlebar.jsx:14:9
   };
 
   const handleClose = () => {
-    if (window.electronAPI) window.electronAPI.closeWindow();
+    if (false) window.electronAPI.closeWindow();
   };
 
killedBy: Titlebar calls electronAPI.closeWindow on close click
statusReason: expected "vi.fn()" to be called once, but got 0 times
